<?php

//rwsz标识
//id 编号
//fl 分类
//mz 名字
//ms 描述
//tj 条件
//sg 杀怪要求数组
//wp 获得物品数组

//tj-dj 等级
//wp-sl 数量

$rwsz = [
    [
        'id' => 2001,
        'fl' => 2,
        'mz' => '[宠物]寻找海龟',
        'ms1' => '我的宠物乌龟不见了，它喜欢去沙滩玩耍，你可以帮我去沙滩上找一下吗？',
        'ms2' => '竟然跑到这里来了，难怪小兰找不到，赶紧把它给小兰送回去吧',
        'ms3' => '谢谢你！这本宠物指南送给你吧。',
        'tj' => [
            'dj' => 1,
        ],
        //自动接受
        'zdjs' => 1,
        //自动完成
        'zdwc' => 1,
        //自动提交
        'zdtj' => 1,
        //接受任务后的任务变量
        'jsbl' => 2,

        // 接受任务继续聊
        'jxl_1' => 0,
        // 完成任务继续聊
        'jxl_2' => 0,

        //任务要求杀怪
        'sg' => [],
        //任务要求物品，完成后扣除
        'kcwp' => [],

        //物品
        'wp' => [
            [
                'id' => 3,
                'fl' => 1,
                'mz' => '宠物指南',
                'sl' => 1,
            ]
        ],
        //经验
        'jy' => 5000,
        //银两
        'yl' => 5000,

        // 快速任务
        'ksrw' => 1,
        'ksrw_x' => 0, //渔村
        'ksrw_y' => 18, //沙滩(1,1)
        // 快速任务费用
        'ksrw_fy' => 100,

        // 快速返回
        'fhrw' => 1,
        'fhrw_x' => 0, //渔村
        'fhrw_y' => 4, //集市
        // 快速任务费用
        'fhrw_fy' => 100,
    ],

    [
        'id' => 2002,
        'fl' => 2,
        'mz' => '拜访师门',
        'ms1' => '加入师门后一定要谨记门规，切勿作恶！',
        'ms2' => '遵命！',
        'ms3' => '这是师门最初级的功法秘籍，拿去学习吧。',
        'tj' => [
            'dj' => 1,
        ],

        'zdjs' => 1,
        'zdwc' => 1,
        'zdtj' => 1,
        'jsbl' => 2,
        'jxl_1' => 1,
        'jxl_2' => 1,

        'sg' => [],
        'kcwp' => [],
        'wp' => [
            [
                'id' => 4,
                'fl' => 1,
                'mz' => '门派秘籍',
                'sl' => 1,
            ]
        ],
        'jy' => 5000,
        'yl' => 5000,

        'ksrw' => 0,
        'ksrw_x' => 0,
        'ksrw_y' => 0,
        'ksrw_fy' => 100,

        'fhrw' => 0,
        'fhrw_x' => 0,
        'fhrw_y' => 0,
        'fhrw_fy' => 100,
    ],

    // 打猎心得
    [
        'id' => 2003,
        'fl' => 2,
        'mz' => '打猎心得',
        'ms1' => '渔夫：打猎靠的是耐心和技巧，一般人可做不了呢',
        'ms2' => '你：我可以试试!',
        'ms3' => '渔夫：好吧，这里是我打猎的一些心得体会，你自己看看吧',
        'tj' => [
            'dj' => 1,
        ],

        'zdjs' => 1,
        'zdwc' => 1,
        'zdtj' => 1,
        'jsbl' => 2,
        'jxl_1' => 1,
        'jxl_2' => 1,

        'sg' => [],
        'kcwp' => [],
        'wp' => [
            [
                'id' => 2,
                'fl' => 1,
                'mz' => '打猎心得',
                'sl' => 1,
            ]
        ],
        'jy' => 5000,
        'yl' => 5000,
        'ksrw' => 0,
        'ksrw_x' => 0,
        'ksrw_y' => 0,
        'ksrw_fy' => 100,
        'fhrw' => 0,
        'fhrw_x' => 0,
        'fhrw_y' => 0,
        'fhrw_fy' => 100,
    ],
    // 排山倒海和霸王枪技能补偿
    [
        'id' => 2004,
        'fl' => 2,
        'mz' => '技能秘籍补偿',
        'ms1' => '所有玩家可以领取无名仙法秘籍，将军府弟子可以领取霸王枪秘籍。',
        'ms2' => '',
        'ms3' => '快去背包中学习技能吧！',
        'tj' => [
            'dj' => 1,
        ],

        'zdjs' => 1,
        'zdwc' => 1,
        'zdtj' => 1,
        'jsbl' => 3,
        'jxl_1' => 1,
        'jxl_2' => 0,

        'sg' => [],
        'kcwp' => [],
        'wp' => [
            [
                'id' => 1107,
                'fl' => 1,
                'mz' => '无名仙法',
                'sl' => 1,
            ],
            [
                'id' => 1108,
                'fl' => 1,
                'mz' => '秦家霸王枪',
                'sl' => 1,
            ],
        ],
        'jy' => 5000,
        'yl' => 5000,
        'ksrw' => 0,
        'ksrw_x' => 0,
        'ksrw_y' => 0,
        'ksrw_fy' => 100,
        'fhrw' => 0,
        'fhrw_x' => 0,
        'fhrw_y' => 0,
        'fhrw_fy' => 100,
    ],
];

return $rwsz;
