<?php

//rwsz标识
//id 编号
//fl 分类
//mz 名字
//ms 描述
//tj 条件
//sg 杀怪要求数组
//wp 获得物品数组

//tj-dj 等级
//wp-sl 数量

$rwsz = [
    [
        'id' => 2001,
        'fl' => 2,
        'mz' => '[宠物]寻找海龟',
        'ms1' => '我的宠物乌龟不见了，它喜欢去沙滩玩耍，你可以帮我去沙滩上找一下吗？',
        'ms2' => '竟然跑到这里来了，难怪小兰找不到，赶紧把它给小兰送回去吧',
        'ms3' => '谢谢你！这本宠物指南送给你吧。',
        'tj' => [
            'dj' => 1,
        ],
        //自动接受
        'zdjs' => 1,
        //自动完成
        'zdwc' => 1,
        //自动提交
        'zdtj' => 1,
        //接受任务后的任务变量
        'jsbl' => 2,

        //任务要求杀怪
        'sg' => [],
        //任务要求物品，完成后扣除
        'kcwp' => [],

        //物品
        'wp' => [
            [
                'id' => 3,
                'fl' => 1,
                'mz' => '宠物指南',
                'sl' => 1,
            ]
        ],
        //经验
        'jy' => 5000,
        //银两
        'yl' => 5000,

        // 快速任务
        'ksrw' => 1,
        'ksrw_x' => 0, //渔村
        'ksrw_y' => 18, //沙滩(1,1)
        // 快速任务费用
        'ksrw_fy' => 100,

        // 快速返回
        'fhrw' => 1,
        'fhrw_x' => 0, //渔村
        'fhrw_y' => 4, //集市
        // 快速任务费用
        'fhrw_fy' => 100,
    ],
];

return $rwsz;
