<?php

$rwnpc = [
    //渔村小兰
    5 => [
        //npc 需要显示的任务
        ['rwid' => 2001, 'rwfl' => 2, 'rwbl' => [1, 3]] //宠物指南
    ],
    10001 => [
        ['rwid' => 2001, 'rwfl' => 2, 'rwbl' => [2]] //宠物指南
    ],
    //渔村渔夫
    4 => [
        //['rwid' => 2003, 'rwfl' => 2, 'rwbl' => [1, 2, 3]] //打猎心得
    ],
    //龙宫大弟子
    171 => [
        ['rwid' => 2002, 'rwfl' => 2, 'rwbl' => [1,2,3]] //门派秘籍
    ],
    //月宫痴梦仙姑
    190 => [
        ['rwid' => 2002, 'rwfl' => 2, 'rwbl' => [1,2,3]] //门派秘籍
    ],
    //普陀知客僧
    211 => [
        ['rwid' => 2002, 'rwfl' => 2, 'rwbl' => [1,2,3]] //门派秘籍
    ],
    //方寸晨月
    201 => [
        ['rwid' => 2002, 'rwfl' => 2, 'rwbl' => [1,2,3]] //门派秘籍
    ],
    //将军府秦平
    121 => [
        ['rwid' => 2002, 'rwfl' => 2, 'rwbl' => [1,2,3]] //门派秘籍
    ],
    //西游补偿大使
    10002 => [
        //['rwid' => 2004, 'rwfl' => 2, 'rwbl' => [1,2,3]]
    ],
];

return $rwnpc;
