<?php

$jnxxsz = [
    [
        'jnid' => 1,
        'jnfl' => 1,
        'jnmz' => '普攻',
        'jnms' => '对单个目标造成普通伤害',
        'shxs' => 1,
    ],
    [
        'jnid' => 2,
        'jnfl' => 1,
        'jnmz' => '挥砍',
        'jnms' => '对单个目标造成较高的伤害',
        'shxs' => 1.2,
    ],
    [
        'jnid' => 4,
        'jnfl' => 1,
        'jnmz' => '排山倒海',
        'jnms' => '酒剑仙传授的仙法',
        'shxs' => 1.4,
    ],
    [
        'jnid' => 5,
        'jnfl' => 1,
        'jnmz' => '举火烧天',
        'jnms' => '将军府专用特殊技能',
        'shxs' => 1.5,
    ],
    [
        'jnid' => 6,
        'jnfl' => 1,
        'jnmz' => '霸王枪',
        'jnms' => '将军府专用特殊技能',
        'shxs' => 1.5,
    ],
    [
        'jnid' => 7,
        'jnfl' => 1,
        'jnmz' => '风波未宁',
        'jnms' => '龙宫专用特殊技能',
        'shxs' => 1.5,
    ],
    [
        'jnid' => 8,
        'jnfl' => 1,
        'jnmz' => '风波十二叉',
        'jnms' => '龙宫专用特殊技能',
        'shxs' => 1.5,
    ],
    [
        'jnid' => 9,
        'jnfl' => 1,
        'jnmz' => '佛光普度',
        'jnms' => '普陀山专用特殊技能',
        'shxs' => 1.5,
    ],
    [
        'jnid' => 10,
        'jnfl' => 1,
        'jnmz' => '如来神掌',
        'jnms' => '普陀山专用特殊技能',
        'shxs' => 1.5,
    ],
    [
        'jnid' => 11,
        'jnfl' => 1,
        'jnmz' => '天师正道',
        'jnms' => '方寸山专用特殊技能',
        'shxs' => 1.5,
    ],
    [
        'jnid' => 12,
        'jnfl' => 1,
        'jnmz' => '五雷咒',
        'jnms' => '方寸山专用特殊技能',
        'shxs' => 1.5,
    ],
    [
        'jnid' => 13,
        'jnfl' => 1,
        'jnmz' => '迷魂心法',
        'jnms' => '月宫专用特殊技能',
        'shxs' => 1.5,
    ],
    [
        'jnid' => 14,
        'jnfl' => 1,
        'jnmz' => '回梦心法',
        'jnms' => '月宫专用特殊技能',
        'shxs' => 1.5,
    ],
    //非战斗技能
    [
        'jnid' => 3,
        'jnfl' => 3,
        'jnmz' => '捕捉',
        'jnms' => '战斗中使用可将对手收为宠物(对玩家无效)',
        'shxs' => 0,
    ],
    [
        'jnid' => 15,
        'jnfl' => 4,
        'jnmz' => '查看',
        'jnms' => '观察敌人的详细情况',
        'shxs' => 0,
    ],
];

return $jnxxsz;
