<?php

$npcsz = [
    [
        'id' => 10001,
        //名字
        'mz' => "乌龟",
        //描述
        'ms' => '小兰饲养的宠物乌龟，看起来迷路了。',
        //NPC被攻击说话语
        'msg' => "动作慢，打不过！",
        //等级
        'dj' => 5,
        //HP
        'hp' => 5000,
        //MAXHP
        'max_hp' => 5000,
        //MP
        'mp' => 1000,
        //MAXMP
        'max_mp' => 1000,
        //攻击
        'gj' => 3434,
        //魔攻
        'mg' => 5345,
        //防御
        'fy' => 4354,
        //魔防
        'mf' => 6378,
        //冰攻
        'bg' => 10,
        //火攻
        'hg' => 10,
        //雷攻
        'lg' => 10,
        //冰防
        'bf' => 10,
        //火防
        'hf' => 10,
        //雷防
        'lf' => 10,
    ],
    [
        'id' => 10002,
        'mz' => "西游补偿大使",
        'ms' => '走过路过不要过错，是玩家就过来领取补偿啦！',
        'msg' => "敢打我？补偿不想要啦？",
        'dj' => 5,
        'hp' => 5000,
        'max_hp' => 5000,
        'mp' => 1000,
        'max_mp' => 1000,
        'gj' => 3434,
        'mg' => 5345,
        'fy' => 4354,
        'mf' => 6378,
        'bg' => 10,
        'hg' => 10,
        'lg' => 10,
        'bf' => 10,
        'hf' => 10,
        'lf' => 10,
    ],
];

return $npcsz;
